quick-start-guide/src/main/resources/QSG/bin/05/update-app-dispatch.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <ns3:updateApplication xmlns:ns3="http://org.apache.axis2/xsd">
  <ns3:serviceProvider>
    <ns1:applicationID xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">2</ns1:applicationID>
    <ns1:applicationName xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">dispatch</ns1:applicationName>
    <claimConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <alwaysSendMappedLocalSubjectId>false</alwaysSendMappedLocalSubjectId>
      <localClaimDialect>true</localClaimDialect>
      <roleClaimURI/>
    </claimConfig>
    <ns1:description xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">sample service provider</ns1:description>
    <inboundAuthenticationConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <inboundAuthenticationRequestConfigs>
        <inboundAuthKey>saml2-web-app-pickup-dispatch.com</inboundAuthKey>
        <inboundAuthType>samlsso</inboundAuthType>
        <properties>
          <name>attrConsumServiceIndex</name>
          <value>1223160755</value>
        </properties>
      </inboundAuthenticationRequestConfigs>
      <inboundAuthenticationRequestConfigs>
        <inboundAuthKey/>
        <inboundAuthType>passivests</inboundAuthType>
      </inboundAuthenticationRequestConfigs>
      <inboundAuthenticationRequestConfigs>
        <inboundAuthKey/>
        <inboundAuthType>openid</inboundAuthType>
      </inboundAuthenticationRequestConfigs>
    </inboundAuthenticationConfig>
    <inboundProvisioningConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <dumbMode>false</dumbMode>
      <provisioningUserStore>PRIMARY</provisioningUserStore>
    </inboundProvisioningConfig>
    <localAndOutBoundAuthenticationConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <alwaysSendBackAuthenticatedListOfIdPs>false</alwaysSendBackAuthenticatedListOfIdPs>
      <authenticationStepForAttributes xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
      <authenticationStepForSubject xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
      <authenticationSteps>
        <federatedIdentityProviders>
          <identityProviderName>IDP-twitter</identityProviderName>
        </federatedIdentityProviders>
      </authenticationSteps>
      <authenticationType>federated</authenticationType>
      <enableAuthorization>false</enableAuthorization>
      <subjectClaimUri>http://wso2.org/claims/fullname</subjectClaimUri>
      <useTenantDomainInLocalSubjectIdentifier>false</useTenantDomainInLocalSubjectIdentifier>
      <useUserstoreDomainInLocalSubjectIdentifier>false</useUserstoreDomainInLocalSubjectIdentifier>
    </localAndOutBoundAuthenticationConfig>
    <outboundProvisioningConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd"/>
    <owner xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <tenantDomain>carbon.super</tenantDomain>
      <userName>cameron</userName>
      <userStoreDomain>PRIMARY</userStoreDomain>
    </owner>
    <permissionAndRoleConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd"/>
    <ns1:requestPathAuthenticatorConfigs xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
    <ns1:saasApp xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">false</ns1:saasApp>
  </ns3:serviceProvider>
</ns3:updateApplication>
   </soapenv:Body>
</soapenv:Envelope>
